export const mockPrivacyTerms = {
  title: '개인정보 처리방침',
  content:
    'StageMate는 회원의 개인정보를 소중히 여기며, 「개인정보 보호법」 등 관계 법령을 준수하여 안전하게 보호하고자 다음과 같은 정책을 수립·운영합니다.\r\n\r\n1. 수집하는 개인정보 항목\r\n - 가입 시: 닉네임, 이메일 주소, 프로필 이미지\r\n - 서비스 이용 시: 접속 IP, 이용기록(글, 댓글, 채팅), 기기 및 브라우저 정보, 쿠키\r\n - 사용자가 직접 제공: 공연 관련 게시글, 후기, 댓글, 1:1 채팅 메시지 등\r\n※ 게시물, 댓글, 채팅 내 포함된 정보도 개인정보로 간주될 수 있으며, 커뮤니티 질서 유지를 위한 분석·보관 대상이 됩니다.\r\n2. 개인정보의 수집 및 이용 목적\r\n - 공연 정보 제공 및 관련 커뮤니티 운영\r\n - 이용자 식별 및 부정 이용 방지\r\n - 고객 문의 및 신고 대응, 분쟁 해결\r\n - 맞춤 콘텐츠 추천, 서비스 품질 향상\r\n - 법령상 의무 이행 및 통계 분석\r\n3. 보유 및 이용 기간\r\n - 회원 탈퇴 시 즉시 파기 (단, 아래 항목은 예외)\r\n - 보관 항목보관 사유보관 기간채팅 기록분쟁 대비 및 악용 방지3개월신고 관련 게시물 및 기록커뮤니티 운영 및 법적 대응6개월이메일, 닉네임회원 식별 이력 확인탈퇴 후 최대 1년\r\n4. 개인정보 제3자 제공 및 위탁\r\n - 원칙적으로 외부에 제공하지 않음\r\n - 단, 공연 제휴사 또는 법령에 따라 사전 동의 후 최소한의 정보 제공 가능\r\n5. 이용자 권리\r\n - 회원은 언제든지 개인정보 열람, 수정, 삭제, 탈퇴를 요청할 수 있습니다.\r\n - 민감 정보는 운영자 승인 또는 요청 절차를 통해 수정 가능합니다.',
};
