export const mockAnnouncementDetail = [
  {
    id: 0,
    title: '공지사항 제목',
    content: `안녕하세요, 공연의 시작은 여기서부터, StageMate입니다.
    보다 안정적인 서비스 제공과 커뮤니티 환경 개선을 위해 아래와 같이 점검을 진행할 예정입니다.회원 여러분의 너른 양해 부탁드리며, 아래 점검 시간 동안 일부 기능 
    이용이 제한될 수 있습니다.
    🔧 점검 안내
    * 점검 일시: 2025년 7월 31일(목) 오전 4시 ~ 오전 7시
    * 영향 범위: 전체 서비스 (웹/앱 커뮤니티, 공연 정보 검색 등)
    🛠 주요 점검 내용
    * 공연별 커뮤니티 게시판의 댓글 정렬 오류 수정
    * 일부 공연 페이지에서 발생하던 이미지 누락 현상 개선
    * 신규 알림 기능 도입 (댓글 답글 알림, 내가 참여한 글 실시간 반응)
    * 채팅 기능 내 말풍선 UI 개선 및 안정화
    * iOS 최신 버전에서의 푸시 미수신 문제 수정
    📝 유의사항
    * 점검 시간 중 서비스 접속이 일시 중단될 수 있습니다.
    * 앱 사용자는 최신 버전으로 업데이트를 권장드립니다.
    * 이용 중 불편하셨던 사항은 [문의하기] 메뉴를 통해 접수해 주세요.
    더 나은 공연 커뮤니티 경험을 위해 앞으로도 StageMate는 꾸준히 개선해 나가겠습니다.

    이용해 주셔서 감사합니다.`,
    createdAt: '25.06.28',
    viewCount: 458,
    author: 'StageMate운영팀',
  },
  {
    id: 1,
    title:
      '정말 진짜 짱 중요한 real important한 요점만 딱 정리한 극비의 공지사항 이거 잘리나 테스트',
    content: `헌법재판소 재판관은 탄핵 또는 금고 이상의 형의 선고에 의하지 아니하고는 파면되지 아니한다. 국회는 선전포고, 국군의 외국에의 파견 또는 외국군대의 대한민국 영역안에서의 주류에 대한 동의권을 가진다.
    대법원은 법률에 저촉되지 아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에 관한 규칙을 제정할 수 있다. 모든 국민은 사생활의 비밀과 자유를 침해받지 아니한다.
    대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는 국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 정부는 회계연도마다 예산안을 편성하여 회계연도 개시 90일전까지 국회에 제출하고, 국회는 회계연도 개시 30일전까지 이를 의결하여야 한다.
    대한민국의 국민이 되는 요건은 법률로 정한다. 국가는 사회보장·사회복지의 증진에 노력할 의무를 진다. 헌법개정안이 제2항의 찬성을 얻은 때에는 헌법개정은 확정되며, 대통령은 즉시 이를 공포하여야 한다.`,
    createdAt: '25.06.28',
    viewCount: 458,
    author: 'StageMate운영팀',
  },
  {
    id: 2,
    title: '공지사항 제목',
    content: `헌법재판소 재판관은 탄핵 또는 금고 이상의 형의 선고에 의하지 아니하고는 파면되지 아니한다. 국회는 선전포고, 국군의 외국에의 파견 또는 외국군대의 대한민국 영역안에서의 주류에 대한 동의권을 가진다.
    대법원은 법률에 저촉되지 아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에 관한 규칙을 제정할 수 있다. 모든 국민은 사생활의 비밀과 자유를 침해받지 아니한다.
    대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는 국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 정부는 회계연도마다 예산안을 편성하여 회계연도 개시 90일전까지 국회에 제출하고, 국회는 회계연도 개시 30일전까지 이를 의결하여야 한다.
    대한민국의 국민이 되는 요건은 법률로 정한다. 국가는 사회보장·사회복지의 증진에 노력할 의무를 진다. 헌법개정안이 제2항의 찬성을 얻은 때에는 헌법개정은 확정되며, 대통령은 즉시 이를 공포하여야 한다.`,
    createdAt: '25.06.28',
    viewCount: 458,
    author: 'StageMate운영팀',
  },
  {
    id: 3,
    title: '공지사항 제목',
    content: `헌법재판소 재판관은 탄핵 또는 금고 이상의 형의 선고에 의하지 아니하고는 파면되지 아니한다. 국회는 선전포고, 국군의 외국에의 파견 또는 외국군대의 대한민국 영역안에서의 주류에 대한 동의권을 가진다.
    대법원은 법률에 저촉되지 아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에 관한 규칙을 제정할 수 있다. 모든 국민은 사생활의 비밀과 자유를 침해받지 아니한다.
    대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는 국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 정부는 회계연도마다 예산안을 편성하여 회계연도 개시 90일전까지 국회에 제출하고, 국회는 회계연도 개시 30일전까지 이를 의결하여야 한다.
    대한민국의 국민이 되는 요건은 법률로 정한다. 국가는 사회보장·사회복지의 증진에 노력할 의무를 진다. 헌법개정안이 제2항의 찬성을 얻은 때에는 헌법개정은 확정되며, 대통령은 즉시 이를 공포하여야 한다.`,
    createdAt: '25.06.28',
    viewCount: 458,
    author: 'StageMate운영팀',
  },
];
